{
  "architectures": [
    "BertForMaskedLM"
  ],
  "directionality": "bidi", 
  "pooler_fc_size": 768, 
  "pooler_num_attention_heads": 12, 
  "pooler_num_fc_layers": 3, 
  "pooler_size_per_head": 128, 
  "pooler_type": "first_token_transform", 
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 21128,
  "encoder_width": 768,
  "add_cross_attention": false,
  "use_cache":false,
  "gradient_checkpointing": false,
  "text_encoder_layers": 6,
  "text_decoder_layers": 12,
  "fusion_layers": 6,
  "stride_layer": 6
}
